---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ScheduleFieldsParam
source: html/8f9d4825-d14f-cd87-6047-f44c8e0140ac.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ScheduleFieldsParam Property

"Fields"

## Syntax (C#)
```csharp
public static ForgeTypeId ScheduleFieldsParam { get; }
```